# 20 Pandas Methods With Examples

In [1]:
import pandas as pd

In [2]:
import numpy as np

### 1. Reading a CSV

In [15]:
#I can import my dataset from a csv file. This is how to do it.

file = "test.csv"

df = pd.read_csv(file)
print(df)

  group  year  value_1  value_2
0     A  2010        3        2
1     A  2011        6        0
2     B  2012        7        4
3     A  2013        0        7
4     B  2014        1        0
5     B  2015        6        1
6     C  2016        0        1
7     A  2017        9        3
8     C  2018        7        0
9     C  2019        4        7

In [12]:
#alternatively, I can create the same dataframe here using numpy

values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})
df

  group  year  value_1  value_2
0     A  2010        3        2
1     A  2011        6        0
2     B  2012        7        4
3     A  2013        0        7
4     B  2014        1        0
5     B  2015        6        1
6     C  2016        0        1
7     A  2017        9        3
8     C  2018        7        0
9     C  2019        4        7

### 2.Query

In [16]:
#Query is used to filter a dataframe based on a condition or apply a mask to get certain values. 
#Example:
df.query('value_1 < value_2') #ie, give me the years where value_1 is less than value_2

  group  year  value_1  value_2
3     A  2013        0        7
6     C  2016        0        1
9     C  2019        4        7

### 3. Insert

In [17]:
'''By default, a new column is added to the end of a dataframe. 
However, pandas allows us add the new column in any position using insert function.
We need to specify the position by passing an index(integer) as first argument. 
Column indices start from zero just like row indices. 
The second argument is column name and the third argument is the object that includes 
values which can be Series or an array-like object.'''
#Example:

#new column
new_col = np.random.randn(10)
df.insert(2, 'new_col', new_col) #insert the new column at position 2
df

  group  year   new_col  value_1  value_2
0     A  2010  0.278756        3        2
1     A  2011 -0.181786        6        0
2     B  2012  0.181442        7        4
3     A  2013  1.341504        0        7
4     B  2014 -0.767910        1        0
5     B  2015  0.648030        6        1
6     C  2016  0.229886        0        1
7     A  2017 -0.733715        9        3
8     C  2018 -0.799097        7        0
9     C  2019 -0.330538        4        7

### 4. Sample

In [18]:
'''Sample allows us to select values randomly from a Series or DataFrame. 
It is useful when we want to select a random sample from a distribution.
We specify the number of values with n parameter.'''

#Example

sample1 = df.sample(n=3)
sample1

  group  year   new_col  value_1  value_2
2     B  2012  0.181442        7        4
6     C  2016  0.229886        0        1
3     A  2013  1.341504        0        7

In [19]:
# but we can also pass a ratio to frac parameter.
#For instance, 0.5 will return half of the rows.

#Example
sample2 = df.sample(frac=0.5)
sample2

  group  year   new_col  value_1  value_2
6     C  2016  0.229886        0        1
4     B  2014 -0.767910        1        0
0     A  2010  0.278756        3        2
7     A  2017 -0.733715        9        3
3     A  2013  1.341504        0        7

### 5. Where

In [23]:
'''We use “Where” to replace values in rows or columns based on a condition.
The default replacement values is NaN but we can also specify the value to be put as a replacement.
'''
#Example:
df['new_col'].where(df['new_col'] > 0 , 2)

0    0.278756
1    2.000000
2    0.181442
3    1.341504
4    2.000000
5    0.648030
6    0.229886
7    2.000000
8    2.000000
9    2.000000
Name: new_col, dtype: float64

In [25]:
'''The way “where” works is that values that fit the condition are selected,
and the remaining values are replaced with the specified value. 
where(df[‘new_col’]>0, 0) selects all the values in “new_col” that are greater than 0
and the remaining values are replaced with 0. 
Thus, 'where' can also be considered as a mask operation.
One important point is that “where” for Pandas and NumPy are not exactly the same. 
We can achieve the same result but with slightly different syntax. 
With DataFrame.where, the values that fit the condition are selected as is 
and the other values are replaced with the specified value. 
Np.where requires to also specify the value for the ones that fit the condition. 
The following two lines return the same result:
df['new_col'].where(df['new_col'] > 0 , 0)

'''
np.where(df['new_col'] > 0, df['new_col'], 2)

array([0.27875641, 2.        , 0.18144153, 1.34150401, 2.        ,
       0.64803027, 0.22988577, 2.        , 2.        , 2.        ])

### 6. Isin

In [30]:
'''Isin method is kind of an advanced filtering. We can filter values based on a list of selections.'''
#Example:

years = [2010,2014,2017]
df[df.year.isin(years)]

  group  year   new_col  value_1  value_2
0     A  2010  0.278756        3        2
4     B  2014 -0.767910        1        0
7     A  2017 -0.733715        9        3

### 7. Loc and iloc

In [34]:
'''Loc and iloc are used to select rows and columns.
•	loc: selects data by labels(columns)
•	iloc: selects data by positions(rows)
loc is used to select data by label. The labels of columns are the column names. 
We need to be careful about row labels. If we do not assign any specific indices, 
pandas created integer index by default. Thus, the row labels are integers starting from 0 and going up. 
The row positions that are used with iloc are also integers starting from 0.
'''
#Example:

#Selecting first 3 rows and first 2 columns with iloc:

df.iloc[:3, :2]

  group  year
0     A  2010
1     A  2011
2     B  2012

In [36]:
#Selecting first 3 rows and first 2 columns with loc:
 
df.loc[:2, ['group', 'year']]   #Note: Upper boundaries of indices are included when loc is used whereas they are excluded with iloc.

  group  year
0     A  2010
1     A  2011
2     B  2012

In [37]:
#Selecting rows “2”, “4”, “6” and columns “year” and “value_1”:

df.loc[[2,4,6], ['year', 'value_1']]

   year  value_1
2  2012        7
4  2014        1
6  2016        0

### 8. Replace

In [42]:
'''replace allows us to replace values in a dataframe.
The first parameter is the value to replaced and the second one is the new value.'''

#Example:
df.replace('A', 'A_1')

  group  year   new_col  value_1  value_2
0   A_1  2010  0.278756        3        2
1   A_1  2011 -0.181786        6        0
2     B  2012  0.181442        7        4
3   A_1  2013  1.341504        0        7
4     B  2014 -0.767910        1        0
5     B  2015  0.648030        6        1
6     C  2016  0.229886        0        1
7   A_1  2017 -0.733715        9        3
8     C  2018 -0.799097        7        0
9     C  2019 -0.330538        4        7

In [43]:
'''We can also pass in a dictionary for multiple replacements at the same time.'''
#Example:
df.replace({'A':'A_1', 'B':'B_1'})

  group  year   new_col  value_1  value_2
0   A_1  2010  0.278756        3        2
1   A_1  2011 -0.181786        6        0
2   B_1  2012  0.181442        7        4
3   A_1  2013  1.341504        0        7
4   B_1  2014 -0.767910        1        0
5   B_1  2015  0.648030        6        1
6     C  2016  0.229886        0        1
7   A_1  2017 -0.733715        9        3
8     C  2018 -0.799097        7        0
9     C  2019 -0.330538        4        7

### 9. Creating a DataFrame

In [45]:
#a. From a list of lists. 

#Example:
#consider the following lists:

data = [[1, 2, "A"], 
        [3, 4, "B"]]

df = pd.DataFrame(data, columns = ["Mon", "Tue", "Wed"])
print(df)

   Mon  Tue Wed
0    1    2   A
1    3    4   B

In [46]:
#b. From a dictionary.

#Example:
#consider the followin dictionary:
data = {'Mon': [1, 2], 
        'Tue': [3, 4], 
        'Wed': ["A", "B"]}

df = pd.DataFrame(data=data)
print(df)

   Mon  Tue Wed
0    1    3   A
1    2    4   B

### 10. The Shape of the DataFrame

In [47]:
print(df)

print("Shape:", df.shape)

   Mon  Tue Wed
0    1    3   A
1    2    4   B
Shape: (2, 3)

### 11. Deleting Column(s)

In [55]:
 print(df.drop(columns = ["Mon"])) #used to delete a column

   Tue Wed
0    3   A
1    4   B

### 12. Renaming Columns

In [56]:
df.rename(columns = {"Wed":"Fri"})   #used to rename a column

   Mon  Tue Fri
0    1    3   A
1    2    4   B

### 13. Filling NaN values

In [57]:
#Missing data is almost inevitable in real-world datasets. To fill NaN set,
#consider the dataframe

df = pd.DataFrame([[1, 2, "A"], [np.nan, 4, "B"]], 
                  columns = ["Mon", "Tue", "Wed"])
print(df)

   Mon  Tue Wed
0  1.0    2   A
1  NaN    4   B

In [69]:
#use the df.fillna() method to replace them with a specific value.
#Example:
df.fillna(0, inplace = True)
print(df)

   Mon  Tue Wed
0  1.0    2   A
1  0.0    4   B

### 14. Handling Duplicates

In [73]:
#You can mark all the repeated rows using the df.duplicated() method:
#Example:

df = pd.DataFrame([[1, "A"], 
                   [2, "B"], 
                   [1, "A"]], 
                  columns = ["col1", "col2"])

                  
df

   col1 col2
0     1    A
1     2    B
2     1    A

In [74]:
df.duplicated(keep=False)

0     True
1    False
2     True
dtype: bool

In [75]:
#Further, you can drop the duplicated rows using the df.drop_duplicates() method as follows:
print(df.drop_duplicates())

   col1 col2
0     1    A
1     2    B

### 15. Data Type

In [76]:
#Dtypes shows the type of data in each column
df.dtypes

col1     int64
col2    object
dtype: object

### 16. Data Size

In [77]:
#data.size returns the size of a dataframe (number of rows multiplied by the number of columns)
df.size

6